#+TITLE: Casual Org Test File

** Casual Org Test File

This is body text.

*** Table Test
#+PLOT: title:"n growth"
#+PLOT: set:"term aqua size 846, 594 font 'Futura,12'"
#+PLOT: type:2d
#+PLOT: set:"key right top"
#+PLOT: set:"xlabel 'n'"
#+PLOT: set:"ylabel 'n*3'"
#+PLOT: set:"xtics font ',10'"
#+PLOT: set:"ytics font ',10'"
#+PLOT: set:"yrange [0:]"
#+PLOT: ind:1 deps:(2)
#+PLOT: with:"linespoints linewidth 3 pointsize 2.0"
 | n | n*3 |
 |---+-----|
 | 1 |   3 |
 | 2 |   6 |
 | 3 |   9 |
 | 4 |  12 |
 |---+-----|
 |   |  30 |
#+TBLFM: $2=$1 *3::@6$2=vsum(@I..@II)

*** Item Test

- a
- b
- c

Checkbox Test

- [ ] task 1
- [ ] task 2
- [ ] task 3

*** Block Tests

#+begin_src elisp
  (message "hi there")
#+end_src
  
#+begin_example
  hi there
#+end_example

#+begin_quote

#+end_quote

#+begin_export html

#+end_export

#+begin_export latex

#+end_export

#+begin_center

#+end_center

#+begin_verse

#+end_verse


* Heading 1

Lorem ipsum dolor sit amet, consectetur adipiscing elit. Maecenas rhoncus felis ut erat semper mollis sed non turpis. Proin rutrum erat et nisi faucibus tincidunt. In a justo urna. Vivamus luctus, lectus sit amet pellentesque pulvinar, lorem urna vulputate sem, non molestie tortor nulla id ipsum. Mauris vitae ligula neque. Maecenas ac lorem augue.

** Heading 2

Nullam ut enim vitae leo molestie viverra non ac lectus. Phasellus volutpat, velit sit amet tempor suscipit, diam lectus vulputate sem, et pretium quam ligula vel augue. Mauris vitae ligula neque. Maecenas ac lorem augue.

*** Heading 3
 Donec feugiat ornare ornare. Aliquam hendrerit, elit id tempus iaculis, eros nisl scelerisque quam, ac posuere turpis felis vitae odio. Phasellus volutpat, velit sit amet tempor suscipit, diam lectus vulputate sem, et pretium quam ligula vel augue.
